### **Pandas practice notebook**

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/2880px-Pandas_logo.svg.png)

### **Pandas Overview**

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license. The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals. Its name is a play on the phrase "Python data analysis" itself. Wes McKinney started building what would become pandas at AQR Capital while he was a researcher there from 2007 to 2010 ([Pandas in wikipedia](https://en.wikipedia.org/wiki/Pandas_(software))).

Fundamentally, the functionality of Pandas is built on top of NumPy and both libraries belong to the SciPy stack. This means that Pandas relies heavily on NumPy array to implement its objects for manipulation and computation — but used in a more convenient fashion.
In practice, NumPy & Pandas are still being used interchangeably. The high level features and its convenient usage are what determine my preference in Pandas.

#### Sources and Contents to review 
1. [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/index.html)
1. [Pandas tutorial by Joris Van den Bossche](https://github.com/jorisvandenbossche/pandas-tutorial)
1. [The Pandas DataFrame: Make Working With Data Delightful](https://realpython.com/pandas-dataframe/)
1. [Why and How to Use Pandas with Large Data](https://towardsdatascience.com/why-and-how-to-use-pandas-with-large-data-9594dda2ea4c#:~:text=Pandas%20has%20been%20one%20of,transforming%2C%20manipulating%20and%20analyzing%20data.)
1. [Community tutorials](https://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html)
1. [A Quick Introduction to the “Pandas” Python Library](https://towardsdatascience.com/a-quick-introduction-to-the-pandas-python-library-f1b678f34673)
1. [Comparison with other tools](https://pandas.pydata.org/docs/getting_started/comparison/index.html)
1. [Datacamp Pandas Cheat Sheet](https://www.datacamp.com/community/blog/python-pandas-cheat-sheet)
1. [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

### **Tutorial**
([source](https://realpython.com/pandas-dataframe/))

You can start working with DataFrames by importing Pandas:

In [2]:
import pandas as pd
import numpy as np

here are several ways to create a Pandas DataFrame. In most cases, you’ll use the DataFrame constructor and provide the data, labels, and other information. You can pass the data as a two-dimensional list, tuple, or NumPy array.

In [3]:
data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
             'Manchester', 'Cairo', 'Osaka'],
     'age': [41, 28, 33, 34, 38, 31, 37],
     'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]}
row_labels = [101, 102, 103, 104, 105, 106, 107]

In [4]:
df = pd.DataFrame(data=data, index=row_labels)
df.head(n=2) # Get the first n rows
df.tail(n=2) # Get the last n rows

     name   city  age  py-score
106  Amal  Cairo   31      61.0
107  Nori  Osaka   37      84.0

In [5]:
cities = df['city'] # or use df.city
cities[101]

'Mexico City'

More examples of creting data frames from list and distionaries

In [6]:
data = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}
pd.DataFrame(data)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [7]:
l = [{'x': 1, 'y': 2, 'z': 100},
     {'x': 2, 'y': 4, 'z': 100},
     {'x': 3, 'y': 8, 'z': 100}]
pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [8]:
l = [[1, 2, 100],  
     [2, 4, 100],
     [3, 8, 100]]
pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [9]:
 arr = np.array([[1, 2, 100],           
                 [2, 4, 100],
                 [3, 8, 100]])
pd.DataFrame(arr, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

Although the last example looks almost the same as the nested list implementation above, it has one advantage: You can specify the optional parameter copy.

When copy is set to False (its default setting), the data from the NumPy array isn’t copied. This means that the original data from the array is assigned to the Pandas DataFrame. If you modify the array, then your DataFrame will change too:

In [10]:
df_1 = pd.DataFrame(arr, columns=['x', 'y', 'z'])
arr[0, 0] = 1000
df_1

      x  y    z
0  1000  2  100
1     2  4  100
2     3  8  100

#### **Creating a Pandas DataFrame From Files**
You can save and load the data and labels from a Pandas DataFrame to and from a number of file types, including CSV, Excel, SQL, JSON, and more. This is a very powerful feature.

You can save your job candidate DataFrame to a CSV file with .to_csv():

In [11]:
df_1.to_csv('data.csv')

You can read csv using `to_csv` method:

In [12]:
df_1 = pd.read_csv('data.csv', index_col=0)

Data Types
The types of the data values, also called data types or dtypes, are important because they determine the amount of memory your DataFrame uses, as well as its calculation speed and level of precision.

Pandas relies heavily on NumPy data types. However, Pandas 1.0 introduced some additional types:

* BooleanDtype and BooleanArray support missing Boolean values and Kleene three-value logic.

* StringDtype and StringArray represent a dedicated string type.

You can get the data types for each column of a Pandas DataFrame with .dtypes:

In [13]:
df.dtypes

name         object
city         object
age           int64
py-score    float64
dtype: object

In [14]:
df = df.astype(dtype={'age': np.int32, 'py-score': np.float32})
df.dtypes

name         object
city         object
age           int32
py-score    float32
dtype: object

#### Pandas DataFrame Size

The attributes .ndim, .size, and .shape return the number of dimensions, number of data values across each dimension, and total number of data values, respectively:

In [15]:
df.ndim

2

In [16]:
df.shape

(7, 4)

In [17]:
df.size

28

In [18]:
df.memory_usage()

Index       376
name         56
city         56
age          28
py-score     28
dtype: int64

#### **Getting Data With Accessors**

Pandas has four accessors in total:

* `.loc[]` accepts the labels of rows and columns and returns Series or DataFrames. You can use it to get entire rows or columns, as well as their parts.

* `.iloc[]` accepts the zero-based indices of rows and columns and returns Series or DataFrames. You can use it to get entire rows or columns, or their parts.

* `.at[]` accepts the labels of rows and columns and returns a single data value.

* `.iat[]` accepts the zero-based indices of rows and columns and returns a single data value.

In [19]:
df.loc[:, 'city']

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [20]:
df.iloc[:, 1]

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [21]:
df.loc[101:105, ['name', 'city']]

       name         city
101  Xavier  Mexico City
102     Ann      Toronto
103    Jana       Prague
104      Yi     Shanghai
105   Robin   Manchester

In [22]:
df.iloc[1:6, [0, 1]]

      name        city
102    Ann     Toronto
103   Jana      Prague
104     Yi    Shanghai
105  Robin  Manchester
106   Amal       Cairo

In [23]:
df.iloc[1:6:2, 0]

102     Ann
104      Yi
106    Amal
Name: name, dtype: object

In [24]:
df.iloc[np.arange(1,6,2), 0]

102     Ann
104      Yi
106    Amal
Name: name, dtype: object

In [25]:
df.at[102, 'name']

'Ann'

In [26]:
df.iat[1, 0]

'Ann'

#### **Setting Data With Accessors**

You can use accessors to modify parts of a Pandas DataFrame by passing a Python sequence, NumPy array, or single value:

In [27]:
df.loc[:104, 'py-score'] = [40, 50, 60, 70]
df.loc[105:, 'py-score'] = 0
df['py-score']

101    40.0
102    50.0
103    60.0
104    70.0
105     0.0
106     0.0
107     0.0
Name: py-score, dtype: float32

In [28]:
df.iloc[:, -1] = np.array([88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0])
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

#### **Inserting and Deleting Data**

Pandas provides several convenient techniques for inserting and deleting rows or columns. You can choose among them based on your situation and needs.

In [29]:
 john = pd.Series(data=['John', 'Boston', 34, 79],
                  index=df.columns, name=108)
print(john)
df = df.append(john)
print(df)

name          John
city        Boston
age             34
py-score        79
Name: 108, dtype: object
       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0
108    John       Boston   34      79.0

In [30]:
df = df.drop(labels=[108])

In [31]:
df['js-score'] = np.array([71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0])
df

       name         city  age  py-score  js-score
101  Xavier  Mexico City   41      88.0      71.0
102     Ann      Toronto   28      79.0      95.0
103    Jana       Prague   33      81.0      88.0
104      Yi     Shanghai   34      80.0      79.0
105   Robin   Manchester   38      68.0      91.0
106    Amal        Cairo   31      61.0      91.0
107    Nori        Osaka   37      84.0      80.0

In [32]:
df['total-score'] = 0.0
df

       name         city  age  py-score  js-score  total-score
101  Xavier  Mexico City   41      88.0      71.0          0.0
102     Ann      Toronto   28      79.0      95.0          0.0
103    Jana       Prague   33      81.0      88.0          0.0
104      Yi     Shanghai   34      80.0      79.0          0.0
105   Robin   Manchester   38      68.0      91.0          0.0
106    Amal        Cairo   31      61.0      91.0          0.0
107    Nori        Osaka   37      84.0      80.0          0.0

In [33]:
df.insert(loc=4, column='django-score',
          value=np.array([86.0, 81.0, 78.0, 88.0, 74.0, 70.0, 81.0]))

You can delete one or more columns from a Pandas DataFrame just as you would with a regular Python dictionary, by using the del statement:

In [34]:
del df['total-score']
df

       name         city  age  py-score  django-score  js-score
101  Xavier  Mexico City   41      88.0          86.0      71.0
102     Ann      Toronto   28      79.0          81.0      95.0
103    Jana       Prague   33      81.0          78.0      88.0
104      Yi     Shanghai   34      80.0          88.0      79.0
105   Robin   Manchester   38      68.0          74.0      91.0
106    Amal        Cairo   31      61.0          70.0      91.0
107    Nori        Osaka   37      84.0          81.0      80.0

You can also remove one or more columns with .drop() as you did previously with the rows. Again, you need to specify the labels of the desired columns with labels. In addition, when you want to remove columns, you need to provide the argument axis=1:

In [35]:
df = df.drop(labels='age', axis=1)

#### **Applying Arithmetic Operations**
You can apply basic arithmetic operations such as addition, subtraction, multiplication, and division to Pandas Series and DataFrame objects the same way you would with NumPy arrays:

In [36]:
df['py-score'] + df['js-score']

101    159.0
102    174.0
103    169.0
104    159.0
105    159.0
106    152.0
107    164.0
dtype: float64

In [37]:
df['py-score'] / 100

101    0.88
102    0.79
103    0.81
104    0.80
105    0.68
106    0.61
107    0.84
Name: py-score, dtype: float64

In [38]:
df['total'] = 0.4 * df['py-score'] + 0.3 * df['django-score'] + 0.3 * df['js-score']

Most NumPy and SciPy routines can be applied to Pandas Series or DataFrame objects as arguments instead of as NumPy arrays. To illustrate this, you can calculate candidates’ total test scores using the NumPy routine numpy.average().

Instead of passing a NumPy array to numpy.average(), you’ll pass a part of your Pandas DataFrame:

In [39]:
np.average(df['django-score'])

79.71428571428571

In [40]:
np.std(df['django-score'])

5.872801368884133

#### **Sorting a Pandas DataFrame**
ou can sort a Pandas DataFrame with .sort_values():

In [41]:
df.sort_values(by='js-score', ascending=False)

       name         city  py-score  django-score  js-score  total
102     Ann      Toronto      79.0          81.0      95.0   84.4
105   Robin   Manchester      68.0          74.0      91.0   76.7
106    Amal        Cairo      61.0          70.0      91.0   72.7
103    Jana       Prague      81.0          78.0      88.0   82.2
107    Nori        Osaka      84.0          81.0      80.0   81.9
104      Yi     Shanghai      80.0          88.0      79.0   82.1
101  Xavier  Mexico City      88.0          86.0      71.0   82.3

The optional parameter inplace can also be used with .sort_values(). It’s set to False by default, ensuring .sort_values() returns a new Pandas DataFrame. When you set inplace=True, the existing DataFrame will be modified and .sort_values() will return None.

In [42]:
df.sort_values(by=['total', 'py-score'], ascending=[False, False])

       name         city  py-score  django-score  js-score  total
102     Ann      Toronto      79.0          81.0      95.0   84.4
101  Xavier  Mexico City      88.0          86.0      71.0   82.3
103    Jana       Prague      81.0          78.0      88.0   82.2
104      Yi     Shanghai      80.0          88.0      79.0   82.1
107    Nori        Osaka      84.0          81.0      80.0   81.9
105   Robin   Manchester      68.0          74.0      91.0   76.7
106    Amal        Cairo      61.0          70.0      91.0   72.7

#### **Filtering Data**
Data filtering is another powerful feature of Pandas. It works similarly to indexing with Boolean arrays in NumPy.

If you apply some logical operation on a Series object, then you’ll get another Series with the Boolean values True and False:

In [43]:
df['django-score'] >= 80

101     True
102     True
103    False
104     True
105    False
106    False
107     True
Name: django-score, dtype: bool

In [44]:
df[df['django-score'] >= 80]

       name         city  py-score  django-score  js-score  total
101  Xavier  Mexico City      88.0          86.0      71.0   82.3
102     Ann      Toronto      79.0          81.0      95.0   84.4
104      Yi     Shanghai      80.0          88.0      79.0   82.1
107    Nori        Osaka      84.0          81.0      80.0   81.9

You can create very powerful and sophisticated expressions by combining logical operations with the following operators:

* NOT (~)
* AND (&)
* OR (|)
* XOR (^)

In [45]:
df[(df['py-score'] >= 80) & (df['js-score'] >= 80)]

     name    city  py-score  django-score  js-score  total
103  Jana  Prague      81.0          78.0      88.0   82.2
107  Nori   Osaka      84.0          81.0      80.0   81.9

For some operations that require data filtering, it’s more convenient to use .where(). It replaces the values in the positions where the provided condition isn’t satisfied:

In [46]:
df['django-score'].where(cond=df['django-score'] >= 80, other=0.0)

101    86.0
102    81.0
103     0.0
104    88.0
105     0.0
106     0.0
107    81.0
Name: django-score, dtype: float64

##### **Determining Data Statistics**

Pandas provides many statistical methods for DataFrames. You can get basic statistics for the numerical columns of a Pandas DataFrame with .describe():

In [47]:
df.describe()

        py-score  django-score   js-score      total
count   7.000000      7.000000   7.000000   7.000000
mean   77.285714     79.714286  85.000000  80.328571
std     9.446592      6.343350   8.544004   4.101510
min    61.000000     70.000000  71.000000  72.700000
25%    73.500000     76.000000  79.500000  79.300000
50%    80.000000     81.000000  88.000000  82.100000
75%    82.500000     83.500000  91.000000  82.250000
max    88.000000     88.000000  95.000000  84.400000

if you want to get particular statistics for some or all of your columns, then you can call methods such as .mean() or .std():

In [48]:
df.mean()

py-score        77.285714
django-score    79.714286
js-score        85.000000
total           80.328571
dtype: float64

In [49]:
df.std()

py-score        9.446592
django-score    6.343350
js-score        8.544004
total           4.101510
dtype: float64

#### **Handling Missing Data**

Missing data is very common in data science and machine learning. But never fear! Pandas has very powerful features for working with missing data. In fact, its documentation has an entire [section dedicated to working with missing data](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html).

Pandas usually represents missing data with NaN (not a number) values. In Python, you can get NaN with float('nan'), math.nan, or numpy.nan. Starting with Pandas 1.0, newer types like BooleanDtype, Int8Dtype, Int16Dtype, Int32Dtype, and Int64Dtype use pandas.NA as a missing value.

In [50]:
df_ = pd.DataFrame({'x': [1, 2, np.nan, 4]})
df_

     x
0  1.0
1  2.0
2  NaN
3  4.0

In [51]:
df_.mean()

x    2.333333
dtype: float64

In [52]:
df_.mean(skipna=False)

x   NaN
dtype: float64

Pandas has several options for filling, or replacing, missing values with other values. One of the most convenient methods is .fillna(). You can use it to replace missing values with:

* Specified values
* The values above the missing value
* The values below the missing value

In [53]:
df_.fillna(value=0)

     x
0  1.0
1  2.0
2  0.0
3  4.0

In [54]:
df_.fillna(method='ffill')

     x
0  1.0
1  2.0
2  2.0
3  4.0

In [55]:
df_.fillna(method='bfill')

     x
0  1.0
1  2.0
2  4.0
3  4.0

Another popular option is to apply interpolation and replace missing values with interpolated values. You can do this with .interpolate():

In [56]:
df_.interpolate()

     x
0  1.0
1  2.0
2  3.0
3  4.0

In certain situations, you might want to delete rows or even columns that have missing values. You can do this with .dropna(

In [57]:
df_.dropna()

     x
0  1.0
1  2.0
3  4.0

#### **Iterating Over a Pandas DataFrame**
As you learned earlier, a DataFrame’s row and column labels can be retrieved as sequences with .index and .columns. You can use this feature to iterate over labels and get or set data values. However, Pandas provides several more convenient methods for iteration:

* `.items()` to iterate over columns
* `.iteritems()` to iterate over columns
* `.iterrows()` to iterate over rows
* `.itertuples()` to iterate over rows and get named tuples

In [58]:
for col_label, col in df.iteritems():
     print(col_label, col.iloc[0])

name Xavier
city Mexico City
py-score 88.0
django-score 86.0
js-score 71.0
total 82.3

With .iterrows(), you iterate over the rows of a Pandas DataFrame. Each iteration yields a tuple with the name of the row and the row data as a Series object:

In [59]:
for row_label, row in df.iterrows():
    print(row_label, row.iloc[0])

101 Xavier
102 Ann
103 Jana
104 Yi
105 Robin
106 Amal
107 Nori

In [60]:
#### **Working With Time Series**
temp_c = [ 8.0,  7.1,  6.8,  6.4,  6.0,  5.4,  4.8,  5.0,
    9.1, 12.8, 15.3, 19.1, 21.2, 22.1, 22.4, 23.1,
    21.0, 17.9, 15.5, 14.4, 11.9, 11.0, 10.2,  9.1]
dt = pd.date_range(start='2019-10-27 00:00:00.0', periods=24, freq='H')
print(temp_c, dt, sep='\n')

[8.0, 7.1, 6.8, 6.4, 6.0, 5.4, 4.8, 5.0, 9.1, 12.8, 15.3, 19.1, 21.2, 22.1, 22.4, 23.1, 21.0, 17.9, 15.5, 14.4, 11.9, 11.0, 10.2, 9.1]
DatetimeIndex(['2019-10-27 00:00:00', '2019-10-27 01:00:00',
               '2019-10-27 02:00:00', '2019-10-27 03:00:00',
               '2019-10-27 04:00:00', '2019-10-27 05:00:00',
               '2019-10-27 06:00:00', '2019-10-27 07:00:00',
               '2019-10-27 08:00:00', '2019-10-27 09:00:00',
               '2019-10-27 10:00:00', '2019-10-27 11:00:00',
               '2019-10-27 12:00:00', '2019-10-27 13:00:00',
               '2019-10-27 14:00:00', '2019-10-27 15:00:00',
               '2019-10-27 16:00:00', '2019-10-27 17:00:00',
               '2019-10-27 18:00:00', '2019-10-27 19:00:00',
               '2019-10-27 20:00:00', '2019-10-27 21:00:00',
               '2019-10-27 22:00:00', '2019-10-27 23:00:00'],
              dtype='datetime64[ns]', freq='H')

In [61]:
temp = pd.DataFrame(data={'temp_c': temp_c}, index=dt)
temp

                     temp_c
2019-10-27 00:00:00     8.0
2019-10-27 01:00:00     7.1
2019-10-27 02:00:00     6.8
2019-10-27 03:00:00     6.4
2019-10-27 04:00:00     6.0
2019-10-27 05:00:00     5.4
2019-10-27 06:00:00     4.8
2019-10-27 07:00:00     5.0
2019-10-27 08:00:00     9.1
2019-10-27 09:00:00    12.8
2019-10-27 10:00:00    15.3
2019-10-27 11:00:00    19.1
2019-10-27 12:00:00    21.2
2019-10-27 13:00:00    22.1
2019-10-27 14:00:00    22.4
2019-10-27 15:00:00    23.1
2019-10-27 16:00:00    21.0
2019-10-27 17:00:00    17.9
2019-10-27 18:00:00    15.5
2019-10-27 19:00:00    14.4
2019-10-27 20:00:00    11.9
2019-10-27 21:00:00    11.0
2019-10-27 22:00:00    10.2
2019-10-27 23:00:00     9.1

Once you have a Pandas DataFrame with time-series data, you can conveniently apply slicing to get just a part of the information:

In [62]:
temp['2019-10-27 05':'2019-10-27 14']

                     temp_c
2019-10-27 05:00:00     5.4
2019-10-27 06:00:00     4.8
2019-10-27 07:00:00     5.0
2019-10-27 08:00:00     9.1
2019-10-27 09:00:00    12.8
2019-10-27 10:00:00    15.3
2019-10-27 11:00:00    19.1
2019-10-27 12:00:00    21.2
2019-10-27 13:00:00    22.1
2019-10-27 14:00:00    22.4

In [63]:
temp.resample(rule='6h').mean()

                        temp_c
2019-10-27 00:00:00   6.616667
2019-10-27 06:00:00  11.016667
2019-10-27 12:00:00  21.283333
2019-10-27 18:00:00  12.016667

In [64]:
temp.rolling(window=3).mean()

                        temp_c
2019-10-27 00:00:00        NaN
2019-10-27 01:00:00        NaN
2019-10-27 02:00:00   7.300000
2019-10-27 03:00:00   6.766667
2019-10-27 04:00:00   6.400000
2019-10-27 05:00:00   5.933333
2019-10-27 06:00:00   5.400000
2019-10-27 07:00:00   5.066667
2019-10-27 08:00:00   6.300000
2019-10-27 09:00:00   8.966667
2019-10-27 10:00:00  12.400000
2019-10-27 11:00:00  15.733333
2019-10-27 12:00:00  18.533333
2019-10-27 13:00:00  20.800000
2019-10-27 14:00:00  21.900000
2019-10-27 15:00:00  22.533333
2019-10-27 16:00:00  22.166667
2019-10-27 17:00:00  20.666667
2019-10-27 18:00:00  18.133333
2019-10-27 19:00:00  15.933333
2019-10-27 20:00:00  13.933333
2019-10-27 21:00:00  12.433333
2019-10-27 22:00:00  11.033333
2019-10-27 23:00:00  10.100000

#### **Group and Aggregate by One or More Columns**
[Source](https://jamesrledoux.com/code/group-by-aggregate-pandas)

Pandas comes with a whole host of sql-like aggregation functions you can apply when grouping on one or more columns. This is Python’s closest equivalent to dplyr’s group_by + summarise logic. Here’s a quick example of how to group on one or multiple columns and summarise data with aggregation functions using Pandas.

In [65]:
data = {"Team": ["Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees"],
		"Pos": ["Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher", "Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher"],
		"Age": [24, 28, 40, 22, 29, 33, 31, 26, 21, 36, 25, 31]}
df = pd.DataFrame(data)
print(df)

       Team          Pos  Age
0   Red Sox      Pitcher   24
1   Red Sox      Pitcher   28
2   Red Sox      Pitcher   40
3   Red Sox  Not Pitcher   22
4   Red Sox  Not Pitcher   29
5   Red Sox  Not Pitcher   33
6   Yankees      Pitcher   31
7   Yankees      Pitcher   26
8   Yankees      Pitcher   21
9   Yankees  Not Pitcher   36
10  Yankees  Not Pitcher   25
11  Yankees  Not Pitcher   31

In [66]:
# group by Team, get mean, min, and max value of Age for each value of Team.
grouped_single = df.groupby('Team').agg({'Age': ['mean', 'min', 'max']})

print(grouped_single)

               Age
              mean min max
Team
Red Sox  29.333333  22  40
Yankees  28.333333  21  36

In [67]:
# rename columns
grouped_single.columns = ['age_mean', 'age_min', 'age_max']

# reset index to get grouped columns back
grouped_single = grouped_single.reset_index()

print(grouped_single)

      Team   age_mean  age_min  age_max
0  Red Sox  29.333333       22       40
1  Yankees  28.333333       21       36

It’s simple to extend this to work with multiple grouping variables. Say you want to summarise player age by team AND position. You can do this by passing a list of column names to groupby instead of a single string value.

In [71]:
grouped_multiple = df.groupby(['Team', 'Pos']).agg({'Age': ['mean', 'min', 'max']})
grouped_multiple.columns = ['age_mean', 'age_min', 'age_max']
grouped_multiple = grouped_multiple.reset_index()
print(grouped_multiple)

      Team          Pos   age_mean  age_min  age_max
0  Red Sox  Not Pitcher  28.000000       22       33
1  Red Sox      Pitcher  30.666667       24       40
2  Yankees  Not Pitcher  30.666667       25       36
3  Yankees      Pitcher  26.000000       21       31

#### **Apply function on a dataframe**

In [70]:
url = "https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv"
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [74]:
def tip_condition(tip):
    if tip>3:
        return 1
    else:
        return 0
tips['tip_condition'] = tips['tip'].apply(tip_condition)
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_condition
0       16.99  1.01  Female     No  Sun  Dinner     2              0
1       10.34  1.66    Male     No  Sun  Dinner     3              0
2       21.01  3.50    Male     No  Sun  Dinner     3              1
3       23.68  3.31    Male     No  Sun  Dinner     2              1
4       24.59  3.61  Female     No  Sun  Dinner     4              1